Repository: doank/t3ext-ig_ldap_sso_auth
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: fr

# mlang_labels_tabdescr
source: LDAP management and configuration module.
fr: Module de gestion et de configuration LDAP.

# mlang_labels_tablabel
source: LDAP management
fr: Gestion LDAP

# title
source: LDAP / SSO service management
fr: Gestion LDAP / service SSO

# configuration_missing.title
source: No Configuration Records
fr: Aucun enregistrement de configuration

# configuration_missing.message
source: This module cannot be used until you create at least one configuration record. Please refer to the <a href="%s" target="_blank">administrator manual</a> for further information.<br /><br /><a href="%s">Click here</a> to create a configuration record.
fr: Ce module ne peut pas être utilisé tant que vous n'avez pas créé au moins un enregistrement de configuration. Veuillez pour référer au &lt;a href="%s" target="_blank"&gt;manual de l'administrateur&lt;/a&gt; pour de plus amples informations.&lt;br /&gt;&lt;br /&gt;&lt;a href="%s"&gt;Cliquez ici&lt;/a&gt; pour créer un enregistrement de configuration.

# module_overview
source: Overview
fr: Vue d'ensemble

# module_status
source: Status
fr: Statut

# module_status.title.domains
source: Domains
fr: Domaines

# module_status.description.domains
source: Current LDAP configuration is restricted to following domain(s):
fr: La configuration LDAP actuelle est limitée au(x) domaine(s) suivant(s) :

# module_status.messages.ldapDisable
source: LDAP is disabled since the host name is undefined.
fr: LDAP est désactivé puisque le nom de serveur est indéfini.

# module_status.messages.enabled
source: enabled
fr: activé

# module_status.messages.disabled
source: disabled
fr: désactivé

# module_status.messages.empty
source: none
fr: aucun

# module_status.title.connection
source: Connection status
fr: Statut de connexion

# module_status.title.frontend
source: Frontend authentication
fr: Authentification frontend

# module_status.title.backend
source: Backend authentication
fr: Authentification backend

# module_status.configuration.server
source: Server type
fr: Type de serveur

# module_status.configuration.charset
source: Character set
fr: Jeu de caractères

# module_status.configuration.host
source: Host
fr: Serveur

# module_status.configuration.tls
source: Use TLS
fr: Utiliser TLS

# module_status.configuration.tlsReqcert
source: TLS require cert
fr: Certificat TLS requis

# module_status.configuration.ssl
source: Use SSL
fr: Utiliser SSL

# module_status.configuration.password
source: Password
fr: Mot de passe

# module_status.configuration.connect
source: LDAP connect
fr: Connexion LDAP

# module_status.configuration.bind
source: LDAP bind
fr: Liaison LDAP

# module_status.configuration.LDAPAuthentication
source: LDAP authentication
fr: Authentification LDAP

# module_status.configuration.forceLowerCaseUsername
source: Convert user name to lower-case
fr: Convertir le nom d'utilisateur en minuscules

# module_status.configuration.evaluateGroupsFromMembership
source: Extract groups from membership attribute
fr: Extraire les groupes de l'attribut d'appartenance à un groupe

# module_status.configuration.IfUserExist
source: User must exist already
fr: L'utilisateur doit déjà exister

# module_status.configuration.IfGroupExist
source: User group must exist already
fr: Le groupe utilisateur doit déjà exister

# module_status.configuration.BEfailsafe
source: Local (non-LDAP) users may authenticate
fr: Les utilisateurs locaux (non LDAP) peuvent s'authentifier

# module_status.configuration.updateAdminAttribForGroups
source: User groups promoted as TYPO3 administrators
fr: Groupes d'utilisateurs promus administrateurs TYPO3

# module_status.configuration.DeleteUserIfNoTYPO3Groups
source: Delete user if not in any TYPO3 user groups
fr: Supprimer l'utilisateur s'il n'est dans aucun groupe d'utilisateurs TYPO3

# module_status.configuration.DeleteUserIfNoLDAPGroups
source: Delete user if not in any LDAP user groups
fr: Supprimer l'utilisateur s'il n'est dans aucun groupe d'utilisateurs LDAP

# module_status.configuration.GroupsNotSynchronize
source: Prevent synchronization of user groups
fr: Empêcher la synchronisation des groupes d'utilisateurs

# module_status.configuration.assignGroups
source: Additional TYPO3 user groups assigned
fr: Groupes d'utilisateurs TYPO3 assignés en plus

# module_status.configuration.keepTYPO3Groups
source: Keep locally-assigned TYPO3 user groups
fr: Garder les groupes d'utilisateurs TYPO3 assignés localement

# module_status.configuration.requiredLDAPGroups
source: Required LDAP user groups to validate authentication
fr: Groupes d'utilisateurs LDAP requis pour valider l'authentification

# module_status.configuration.users
source: Configuration for users
fr: Configuration pour les utilisateurs

# module_status.configuration.groups
source: Configuration for user groups
fr: Configuration pour les groupes d'utilisateurs

# module_search
source: Search wizard
fr: Assistant de recherche

# module_search_type.frontendUsers
source: Frontend users
fr: Utilisateurs frontend

# module_search_type.frontendUserGroups
source: Frontend user groups
fr: Groupes d'utilisateurs frontend

# module_search_type.backendUsers
source: Backend users
fr: Utilisateurs backend

# module_search_type.backendUserGroups
source: Backend user groups
fr: Groupes d'utilisateurs backend

# module_search_options.firstEntry
source: First entry only
fr: Seulement la première entrée

# module_search_options.status
source: Show status
fr: Afficher le statut

# module_search_filter
source: Filter
fr: Filtre

# module_search.action.search
source: search
fr: rechercher

# module_search_status
source: LDAP search status
fr: Statut de recherche LDAP

# module_search_result
source: Result
fr: Résultats

# module_search_noResult
source: No results
fr: Aucun résultat

# module_search_preview
source: Preview mapping
fr: Prévisualisation du mapping

# module_import.action.import
source: import
fr: importer

# module_import.action.update
source: update
fr: mettre à jour

# module_import.action.undelete
source: undelete
fr: récupérer

# module_import_users_fe
source: Import LDAP users (Frontend)
fr: Importer des utilisateurs LDAP (Frontend)

# module_import_users_be
source: Import LDAP users (Backend)
fr: Importer des utilisateurs LDAP (Backend)

# module_import_users.empty
source: No users found.
fr: Aucun utilisateur trouvé.

# module_import_users.caption_local
source: LDAP user is available locally
fr: L'utilisateur LDAP est disponible localement

# module_import_users.caption_deleted
source: LDAP user has been imported but then manually deleted
fr: L'utilisateur LDAP a été importé mais a ensuite été supprimé manuellement

# module_import.field.name
source: Name
fr: Nom

# module_import_groups_fe
source: Import LDAP groups (Frontend)
fr: Importer des groupes LDAP (Frontend)

# module_import_groups_be
source: Import LDAP groups (Backend)
fr: Importer des groupes LDAP (Backend)

# module_import_groups.empty
source: No groups found.
fr: Aucun groupe trouvé.

# module_import_groups.caption_local
source: LDAP group is available locally
fr: Le groupe LDAP est disponible localement

# module_import_groups.caption_deleted
source: LDAP group has been imported but then manually deleted
fr: Le groupe LDAP a été importé mais a ensuite été supprimé manuellement

# task.import_users.title
source: Import LDAP users
fr: Importer des utilisateurs LDAP

# task.import_users.description
source: Import LDAP for one or all configurations, for FE, BE or both. Users missing on the LDAP side will be disabled.
fr: Importer des utilisateurs LDAP pour une ou plusieurs configurations, pour le frontend, le backend ou les deux. Les utilisateurs qui ne sont pas présents côté LDAP seront désactivés.

# task.import_users.field.mode.import
source: Import missing LDAP users and synchronize existing TYPO3 users
fr: Importer les utilisateurs LDAP manquants et synchroniser les utilisateurs TYPO3 existants

# task.import_users.field.mode.sync
source: Only synchronize existing TYPO3 users
fr: Uniquement synchroniser les utilisateurs TYPO3 existants

# task.import_users.field.mode.import.short
source: Import & synchronize
fr: Importer &amp; synchroniser

# task.import_users.field.mode.sync.short
source: Synchronize
fr: Synchroniser

# task.import_users.field.context
source: Context
fr: Contexte

# task.import_users.field.context.both
source: Both
fr: Les deux

# task.import_users.field.configuration.all
source: All
fr: Tous

# task.import_users.additionalinformation
source: Mode: %s, Context: %s, Configuration: %s
fr: Mode : %s, Contexte : %s, Configuration : %s

# task.import_users.field.missinguserhandling
source: Handling of missing users
fr: Comportement avec les utilisateurs manquants

# task.import_users.field.missinguserhandling.disable
source: Disable
fr: Désactiver

# task.import_users.field.missinguserhandling.delete
source: Delete
fr: Supprimer

# task.import_users.field.missinguserhandling.nothing
source: Do nothing
fr: Ne rien faire

# task.import_users.field.restoreduserhandling
source: Handling of restored users
fr: Comportement avec les utilisateurs récupérés

# task.import_users.field.restoreduserhandling.enable
source: Re-enable
fr: Réactiver

# task.import_users.field.restoreduserhandling.undelete
source: Undelete
fr: Restaurer

# task.import_users.field.restoreduserhandling.both
source: Re-enable and undelete
fr: Réactiver et restaurer

# task.import_users.field.restoreduserhandling.nothing
source: Do nothing
fr: Ne rien faire
