Repository: doank/t3ext-ig_ldap_sso_auth
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: fr

# settings.checkConfiguration
source: Configuration check
fr: Vérification de la configuration

# settings.throwExceptionAtLogin
source: Throw exception if configured incorrectly: Recommended for new installation - LDAP authentication is not compatible with loginSecurityLevel set to "challenged" or "superchallenged" since the real password can never be sent against the LDAP repository. Instead of failing silently, the extension will throw an exception at login. If the method appears to be brutal it will save a lot of headaches. Value of loginSecurityLevel should be handled manually to "normal" or even better "rsa" in the Install Tool.
fr: Lève une exception si configuré de façon incorrecte: Recommandé pour de nouvelles installations - l'authentification LDAP n'est pas compatible avec loginSecurityLevel paramétré à "challenged" ou "superchallenged" car le mot de passe réel n'est jamais transmis et ne peut pas par conséquent être envoyé au dépôt LDAP. Au lieu d'échouer silentieusement, l'extension va lever une exception au moment du login. Si la méthode paraît être brutale, elle va néanmoins vous épargner de nombreux maux de tête. La valeur de loginSecurityLevel devrait être changée manuellement à "normal" ou mieux à "rsa" dans l'Install Tool.

# settings.forceLowerCaseUsername
source: Force lower-case user name: If checked, user names will be always be stored in lower-cases. Useful for case-sensitive databases.
fr: Forcer les noms d'utilisateurs en minuscules: Si coché, les noms d'utilisateurs seront toujours stockés en minuscules. Utile pour les bases de données sensibles à la casse.

# settings.enableBELDAPAuthentication
source: Backend LDAP authentication: Enable LDAP authentication for the backend.
fr: Authentification LDAP Backend: Active l'authentification LDAP pour le Backend.

# settings.TYPO3BEGroupExist
source: Backend user group must exist: If no groups are found locally, the user may not log on.
fr: Le groupe d'utilisateurs Backend doit exister: Si aucun groupe n'est trouvé en local, l'utilisateur ne peut pas s'authentifier.

# settings.TYPO3BEUserExist
source: Backend user must exist: If checked, users that are not already present in TYPO3 may not log on.
fr: L'utilisateur Backend doit exister: Si coché, les utilisateurs qui ne sont pas déjà présents dans TYPO3 ne peuvent pas s'authentifier.

# settings.BEfailsafe
source: Enable local Backend users: If checked, Backend users without a reference to LDAP (e.g., "admin") may log on.
fr: Activer les utilisateurs Backend locaux: Si coché, les utilisateurs Backend sans référence à LDAP (p. ex. "admin") peuvent s'authentifier.

# settings.TYPO3BEGroupsNotSynchronize
source: Disable Backend group synchronization: If checked, TYPO3 Backend user groups will not get updated.
fr: Désactiver la synchronisation des groupes Backend: Si coché, les groupes d'utilisateurs Backend de TYPO3 ne seront pas mis à jour.

# settings.keepBEGroups
source: Keep Backend groups: Keep the Backend user groups assigned locally.
fr: Garder les groupes backend: Garde les groupes d'utilisateurs backend assignés localement.

# settings.enableFELDAPAuthentication
source: Frontend LDAP authentication: Enable LDAP authentication for the frontend.
fr: Authentification LDAP Frontend: Active l'authentification LDAP pour le Frontend.

# settings.TYPO3FEDeleteUserIfNoLDAPGroups
source: Purge Frontend users: Delete Frontend user upon login if no LDAP groups are found.
fr: Purger les utilisateurs Frontend: Supprime les utilisateurs Frontend lors de l'authentification si aucun groupe LDAP n'est trouvé.

# settings.TYPO3FEGroupExist
source: Frontend user group must exist: If no groups are found locally, the user may not log on.
fr: Le groupe d'utilisateurs Frontend doit exister: Si aucun groupe n'est trouvé localement, l'utilisateur ne peut pas s'authentifier.

# settings.TYPO3FEUserExist
source: Frontend user must exist: If checked, users that are not already present in TYPO3 may not log on.
fr: L'utilisateur Frontend doit exister: Si coché, les utilisateurs qui ne sont pas déjà présents dans TYPO3 ne peuvent pas s'authentifier.

# settings.TYPO3FEGroupsNotSynchronize
source: Disable Frontend group synchronization: If checked, TYPO3 Frontend user groups will not get updated.
fr: Désactiver la synchronisation des groupes Frontend: Si coché, les groupes d'utilisateurs Frontend TYPO3 ne seront pas mis à jour.

# settings.keepFEGroups
source: Keep Frontend groups: Keep the Frontend user groups assigned locally.
fr: Garder les groupes frontend: Garde les groupes d'utilisateurs frontend assignés localement.

# settings.enableFESSO
source: Frontend SSO: Enable Single Sign-On for Frontend users.
fr: SSO frontend: Active le single sign-on pour les utilisateurs frontend.

# tx_igldapssoauth_config.name
source: Name:
fr: Nom :

# tx_igldapssoauth_config.domains
source: Associated domains:
fr: Domaines associés :

# tx_igldapssoauth_config.ldap_server
source: Server Type:
fr: Type de serveur :

# tx_igldapssoauth_config.ldap_charset
source: Character set:
fr: Jeu de caractères :

# tx_igldapssoauth_config.ldap_host
source: Host:
fr: Serveur :

# tx_igldapssoauth_config.ldap_tls
source: Use TLS:
fr: Utiliser TLS :

# tx_igldapssoauth_config.ldap_ssl
source: Use SSL:
fr: Utiliser SSL :

# tx_igldapssoauth_config.ldap_password
source: Password:
fr: Mot de passe :

# tx_igldapssoauth_config.group_membership
source: Relation between groups and users:
fr: Relation entres les groupes et les utilisateurs :

# tx_igldapssoauth_config.group_membership.I.1
source: Group contains the list of its members
fr: Le groupe contient la liste des membres

# tx_igldapssoauth_config.group_membership.I.2
source: User contains the list of its associated groups
fr: L'utilisateur contient la liste des groupes associés

# tx_igldapssoauth_config.group_membership.fe.missingUsergroupMapping
source: Mapping for field "usergroup" is missing in the configuration of frontend users. You may end up importing ALL groups in LDAP into TYPO3 and get users associated to wrong groups. Suggestion: usergroup = <memberOf>
fr: La correspondance pour le champ "usergroup" n'est pas définie dans la configuration des utilisateurs frontend. Vous risquez de provoquer l'importation de TOUS les groupes de LDAP dans TYPO3 et d'associer vos utilisateurs à des groupes invalides. Suggestion : usergroup = &lt;memberOf&gt;

# tx_igldapssoauth_config.group_membership.be.missingUsergroupMapping
source: Mapping for field "usergroup" is missing in the configuration of backend users. You may end up importing ALL groups in LDAP into TYPO3 and get users associated to wrong groups. Suggestion: usergroup = <memberOf>
fr: La correspondance pour le champ "usergroup" n'est pas définie dans la configuration des utilisateurs backend. Vous risquez de provoquer l'importation de TOUS les groupes de LDAP dans TYPO3 et d'associer vos utilisateurs à des groupes invalides. Suggestion : usergroup = &lt;memberOf&gt;

# tx_igldapssoauth_config.be_users_filter
source: Filter:
fr: Filtre :

# tx_igldapssoauth_config.be_groups_filter
source: Filter:
fr: Filtre :

# tx_igldapssoauth_config.be_groups_required
source: Required LDAP groups:
fr: Groupes LDAP requis :

# tx_igldapssoauth_config.be_groups_assigned
source: Local groups to be assigned:
fr: Groupes locaux à assigner :

# tx_igldapssoauth_config.be_groups_admin
source: TYPO3 administrator groups:
fr: Groupes TYPO3 administrateurs :

# tx_igldapssoauth_config.be_groups.tx_igldapssoauth_dn
source: Groups DN (Distinguished Name)
fr: DN des groupes (Distinguished Name)

# tx_igldapssoauth_config.fe_users_filter
source: Filter:
fr: Filtre :

# tx_igldapssoauth_config.fe_groups_filter
source: Filter:
fr: Filtre :

# tx_igldapssoauth_config.fe_groups_required
source: Required LDAP groups:
fr: Groupes LDAP requis :

# tx_igldapssoauth_config.fe_groups_assigned
source: Local groups to be assigned:
fr: Groupes locaux à assigner :

# be_groups.tx_igldapssoauth_dn
source: Group's DN (Distinguished Name)
fr: DN du groupe (Distinguished Name)

# be_users.tx_igldapssoauth_dn
source: User's DN (Distinguished Name)
fr: DN de l'utilisateur (Distinguished Name)

# fe_groups.tx_igldapssoauth_dn
source: Group's DN (Distinguished Name)
fr: DN du groupe (Distinguished Name)

# fe_users.tx_igldapssoauth_dn
source: User's DN (Distinguished Name)
fr: DN de l'utilisateur (Distinguished Name)

# tt_content.list_type_pi1
source: Central Authentication Service
fr: Service d'authentification central

# palette.connection
source: Connection
fr: Connexion

# suggestion.server.0
source: Suggestion for OpenLDAP:
fr: Suggestion pour OpenLDAP :

# suggestion.copy
source: copy and use
fr: copier et utiliser
